# GetHandleName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstrainedHandle..::..GetHandleName Method
RebarConstrainedHandle Class See Also
---
Gets the name of the handle.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public string GetHandleName()
```

Visual Basic
---
```text
Public Function GetHandleName As String
```

Visual C++
---
```text
public:
String^ GetHandleName()
```

# ### Return Value
Returns the name of the handle. In case of handles of CustomHandle type it can return null if the .dll that contains the server is not loaded.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | RebarConstrainedHandle is no longer valid. |

# See Also
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace